# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 1024] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  # RGB
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] #2
  - [-1, 1, Conv, [256, 3, 2]] #3-

  # IR
  - [-4, 1, Conv, [64, 3, 2]] # 4
  - [-1, 1, Conv, [128, 3, 2]] # 5
  - [-1, 2, C3k2, [256, False, 0.25]] # 6
  - [-1, 1, Conv, [256, 3, 2]] # 7

  - [-3,1,COD,[128,128]] #8

  # RGB
  - [-4, 2, C3k2, [512, True, 0.25]] #9
  - [-1, 1, Conv, [512, 3, 2]] # 10

  # IR
  - [-4, 2, C3k2, [512, True, 0.25]] # 11
  - [-1, 1, Conv, [512, 3, 2]] # 12

  # Fusion2
  - [-3,1,COD,[256,256]]  #13

  # RGB
  - [-4, 2, C3k2, [512, True]] #14
  - [-1, 1, Conv, [1024, 3, 2]] # 15

  # IR
  - [-4, 2, C3k2, [512, True]] #16
  - [-1, 1, Conv, [1024, 3, 2]] # 17

  # Fusion3
  - [-3,1,COD,[512,512]] #18

  # RGB
  - [-4, 2, C3k2, [1024, True]] #19
  - [-1, 1, SPPF, [1024, 5]] # 20
  - [-1, 2, C2PSA, [1024]] # 21

  # IR
  - [-4, 2, C3k2, [1024, True]] #22
  - [-1, 1, SPPF, [1024, 5]] # 23
  - [-1, 2, C2PSA, [1024]] #24


  - [[0,9,11], 1, DCE, [1]] # 25
  - [[0,14,16], 1, DCE, [1]] # 26
  - [[0,21,24],1, DCE, [1]] # 27

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #28
  - [[-1, 26], 1, Concat, [1]] # 29
  - [-1, 2, C3k2, [512, False]] # 30

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #31
  - [[-1, 25], 1, Concat, [1]] # 32
  - [-1, 2, C3k2, [256, False]] # 33

  - [-1, 1, Conv, [256, 3, 2]] #34
  - [[-1, 30], 1, Concat, [1]] # 35
  - [-1, 2, C3k2, [512, False]] # 36

  - [-1, 1, Conv, [512, 3, 2]] # 37
  - [[-1, 27], 1, Concat, [1]] # 38
  - [-1, 2, C3k2, [1024, True]] # 39

  - [[33, 36, 39], 1, Detect, [nc]] # 40